Revit 2024 API
BuiltInFailures.SketchFailures.AreaLoadNoForce Property
 Area Load can't have all force components equal to zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AreaLoadNoForce { get; }
Visual Basic
Public Shared ReadOnly Property AreaLoadNoForce As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AreaLoadNoForce {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace